---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.Diameter
zh: 直径、管径
source: html/cb0f0eb3-bb90-2f8f-39d9-6dc9d2c2a542.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.Diameter Property

**中文**: 直径、管径

Pipe Diameter.

## Syntax (C#)
```csharp
public double Diameter { get; set; }
```